{
  "tagName": "BODY",
  "children": [
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "This is part 2 of a multi-part series on working with tech recruiters and staffing agencies.",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "In ",
          "children": []
        },
        {
          "tagName": "A",
          "children": [
            {
              "tagName": "#text",
              "text": "part one",
              "children": []
            }
          ]
        },
        {
          "tagName": "#text",
          "text": ", we talked about the right times in your career to work with tech recruiters, and good mindsets to have when working with them. In this post, we’ll dive into some of the pros and cons to consider when working with recruiters.",
          "children": []
        }
      ]
    },
    {
      "tagName": "H2",
      "children": [
        {
          "tagName": "#text",
          "text": "Pro: the connections you don’t have",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "The whole premise of using a recruiter or headhunter for getting any type of job (freelance or otherwise) is ",
          "children": []
        },
        {
          "tagName": "STRONG",
          "children": [
            {
              "tagName": "#text",
              "text": "connecting",
              "children": []
            }
          ]
        },
        {
          "tagName": "#text",
          "text": ": recruiters have access to companies and individuals at those companies that you don’t have access to yet.",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "Want to transition from the Fortune 500 world to the startup world? You could network your butt off, but that takes time. Find a recruiter that specializes in the startup world, and you could be working right away.",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "What if your goal is to work at a specific company? You could cold email hiring managers at your target company, but you may have to email a bunch to get a response. Out of those emails, only some will respond. And only some of that batch will be looking for someone with your skillset. On the other hand, a recruiter who is helping that company hire someone like you will be able to connect you right away.",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "You can do plenty of networking yourself, and you should, in general. But you can’t do it full-time while you’ve already got a job. It’s just not possible for most people without overworking themselves.",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "For a recruiter, connections are their job. Having them connect you with a hiring manager is like paying someone to do your laundry. You could do it yourself, but do you want to do all that work right now? (And unlike hiring someone to do your laundry, a recruiter is going to make you money.)",
          "children": []
        }
      ]
    },
    {
      "tagName": "H2",
      "children": [
        {
          "tagName": "#text",
          "text": "Pro: they handle the boring stuff",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "As a freelance programmer you can opt to incorporate yourself, and in turn take on all the corporate taxes, invoicing, paying an insane amount for health insurance and so on. It’s a great experience, and there are many reasons to consider doing it, but it’s also a big pain in the butt.",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "If you work for a staffing agency, they handle all the boring shit, including but not limited to:",
          "children": []
        }
      ]
    },
    {
      "tagName": "UL",
      "children": [
        {
          "tagName": "LI",
          "children": [
            {
              "tagName": "STRONG",
              "children": [
                {
                  "tagName": "#text",
                  "text": "Invoicing the client, and getting them to pay",
                  "children": []
                }
              ]
            },
            {
              "tagName": "#text",
              "text": " (which can be time-consuming when working directly for some clients – seriously).",
              "children": []
            }
          ]
        },
        {
          "tagName": "LI",
          "children": [
            {
              "tagName": "STRONG",
              "children": [
                {
                  "tagName": "#text",
                  "text": "Liability insurance.",
                  "children": []
                }
              ]
            },
            {
              "tagName": "#text",
              "text": " Some larger companies won’t let you consult directly for them without millions in liability coverage. You won’t have the money for this; staffing agencies will. It’s also a big reassurance since in the unlikely event of a bad lawsuit, losing your job is highly preferable to being sued and having your personal assets taken away.",
              "children": []
            }
          ]
        },
        {
          "tagName": "LI",
          "children": [
            {
              "tagName": "STRONG",
              "children": [
                {
                  "tagName": "#text",
                  "text": "Providing health insurance.",
                  "children": []
                }
              ]
            },
            {
              "tagName": "#text",
              "text": " Which is pretty freaking expensive otherwise.",
              "children": []
            }
          ]
        },
        {
          "tagName": "LI",
          "children": [
            {
              "tagName": "STRONG",
              "children": [
                {
                  "tagName": "#text",
                  "text": "Planning for tax season.",
                  "children": []
                }
              ]
            },
            {
              "tagName": "#text",
              "text": " With your own LLC, you’ll have to put aside money for the tax man. When working with a staffing agency, you’ll often be an employee of the agency (on a W-2). Which means you can opt to have taxes taken out with each paycheck instead of getting hit with a big bill in April, or paying a large sum every tax quarter.",
              "children": []
            }
          ]
        }
      ]
    },
    {
      "tagName": "H2",
      "children": [
        {
          "tagName": "#text",
          "text": "Pro: options, options, options",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "Let’s say you’re a solid engineer looking for a new project. You might get random job offers, and you might manually apply to jobs. If you’re smart, you’ll do both. But sometimes it’s a numbers game to find the project you want. The more options you’ve got, the pickier you can be, and the happier you’ll be with the one that you pick.",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "If you’ve got 100 job prospects without a recruiter, you could have 200 by talking to a few of them. It sure as hell can’t hurt. You may make less money when taking a job through a recruiter, but if they can connect you with a project you really want—sometimes it’s worth a temporary sacrifice. Moreover, after the project, you can move on and (often) charge more. More on this in part 3.",
          "children": []
        }
      ]
    },
    {
      "tagName": "H2",
      "children": [
        {
          "tagName": "#text",
          "text": "Pro: timing is everything",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "Sometimes getting work takes…well, work. If you just ended a project and are beginning to look for another one, chances are you won’t get one right away. Usually, for this reason, it’s good to start looking while you’re 2+ months away from the end of a project; but at that point in time, you’ll still be busy ",
          "children": []
        },
        {
          "tagName": "EM",
          "children": [
            {
              "tagName": "#text",
              "text": "working on the project itself",
              "children": []
            }
          ]
        },
        {
          "tagName": "#text",
          "text": ". Hunting for work has the potential to distract you from your current job.",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "Recruiters have projects in the pipeline all the damn time, and they’re usually starting soon. Keep in mind that companies often use recruiters because either they’re having trouble finding the people they want to hire, or they just don’t have the time.",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "In addition, if you’ve got relationships with a few recruiters, they’ll be bringing the work to you when they have something that fits—which will be all the time if you’re engaging with a few of them. That means you’ll be getting project offers the whole time you’re working on your current project, so you can focus on getting your work done instead of distracting yourself with job hunting.",
          "children": []
        }
      ]
    },
    {
      "tagName": "H2",
      "children": [
        {
          "tagName": "#text",
          "text": "Con: money off your back",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "This is a shocking realization for a lot of freelance developers who take their first consulting project through a staffing agency: they make money off your work. And sometimes, it’s a lot.",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "Here’s an experience I had back around 2001: I was working at a client’s office for more than a year, through a staffing agency. I was making $45 per hour. I found out that the agency was charging the client about $140 per hour. That’s a 300% markup! What the f**k?",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "This is the part I struggled with the most. Staffing agencies will connect you with work you couldn’t get as quickly or easily, and handle the paperwork for you. They deserve to make some money off of this. But 300%? For months at a time?",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "Nowadays it still happens, only with higher stakes. Engineers make more, but companies can charge a whole lot more since clients pay more. I know of engineers who made $65/hour but got their work billed to the client at $230/hr.",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "Agencies need to pay the bills too, so they need to make something off the services they provide: namely connecting companies with talent, and handling all the routine paperwork associated with it. However, there’s a point at which the markup is too severe, and the duration is too long to be worth it. In the next post in this series, I’ll discuss ways to deal with this challenge.",
          "children": []
        }
      ]
    },
    {
      "tagName": "H2",
      "children": [
        {
          "tagName": "#text",
          "text": "Con: intermediaries and white labeling",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "This affects the amount you take home as well. Sometimes you’ll work through multiple agencies to get the project. I was on a project like that just recently; one agency hired me to put me on a project for another agency that had a project for a technology company (the client). The client paid the bills, but two companies took a cut before I got my paycheck, which means that the rate I got wasn’t anywhere near what the client was paying per hour.",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "This process is called “white-labeling”—where you get hired by one company which rents you out to another company, who places you on a client project. The client often perceives you as working for the second agency, who is working directly for them. This process happens a lot in the technical consulting world. There’s nothing inherently wrong with it at all—everybody needs more help serving their clients at some point, and it’s not always necessary for the client to know that you borrowed an engineer from another company.",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "The downside (for you) is that you take two cuts in your salary, and sometimes you don’t get the credit. Which leads to our next challenge…",
          "children": []
        }
      ]
    },
    {
      "tagName": "H2",
      "children": [
        {
          "tagName": "#text",
          "text": "Con: non-competes",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "When a client hires an agency, and the agency hires you, the client is not your client. Meaning, your contract will often legally prohibit you from working directly for that client for at least a period of 2 years (this number may vary).",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "While you’re working for them during that 2-year period, often your contract will give them an option to hire you as a salaried employee (if you want to be hired, of course). But the agency will charge a significant fee for this—about 20% of a year’s salary which the client hires you at in my experience. I’ve heard some say it could go as high as 50%, but I’ve yet to hear of an example of this.",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "To put things in perspective, given a typical engineer’s salary these days, this means the client will have to kick in anywhere from $12,000-$36,000 to legally hire you through the agency, on top of having to pay your salary (assuming a salary range of $60k-$160k). So they’ve got to weigh out how much value you’ll add the company long-term, and if it’s worth the upfront investment.",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "There are ways around this limitation though. Make sure you check out the next post in this series.",
          "children": []
        }
      ]
    },
    {
      "tagName": "H2",
      "children": [
        {
          "tagName": "#text",
          "text": "Con: no portfolio piece for you",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "When working with recruiters, staffing agencies, and consulting agencies, often they’ll retain exclusive credit for the work you do. Not always, but it’s not uncommon. They’re building their brand as an agency, and a big part of how they do that is listing clients and projects in their portfolio – which means you don’t get to do so on your website.",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "The natural downside to this is that you’ll have less to show off on your own website, and when you do some truly kickass work, it can be a bitter pill to swallow. But there are times when it’s a worthwhile sacrifice, and I also have ways you can work around this which I’ll talk about in part 3.",
          "children": []
        }
      ]
    },
    {
      "tagName": "H2",
      "children": [
        {
          "tagName": "#text",
          "text": "Summary",
          "children": []
        }
      ]
    },
    {
      "tagName": "P",
      "children": [
        {
          "tagName": "#text",
          "text": "In ",
          "children": []
        },
        {
          "tagName": "A",
          "children": [
            {
              "tagName": "#text",
              "text": "part 1",
              "children": []
            }
          ]
        },
        {
          "tagName": "#text",
          "text": " we talked about when to use recruiters and staffing agencies to further your freelance programming career and build relationships. In this installment, we talked about the benefits and potential pitfalls of working with them. In part 3, we’ll discuss the how of working with tech recruiters—tips and tactics for leveraging them properly in order to get the most benefits (and working around the sacrifices you might have to make).",
          "children": []
        }
      ]
    }
  ]
}